import { nanoid } from 'nanoid';

export const data = {
  posts: [
    {
      id: nanoid(),
      title:
        '«Болгары снова восхитились»: иностранные комментаторы из заметок РИА «Новости», хвалящие Россию, стали героями мема',
      text: 'Привет, на связи Павел Мосейкин, сооснователь и генеральный директор школы XYZ. Мы учим делать игры — создавать 3D-графику и концепты, придумывать персонажей и программировать. За два года через наши курсы прошли 140 000 студентов, которые рекомендуют нас знакомым и хвалят за крутой контент В июне на DTF появился пост: группа студентов XYZ School пожаловалась на один из 45 наших курсов — GameCode. За два дня статья набрала 100 тысяч просмотров и стала самой популярной за всю историю сайта.Привет, на связи Павел Мосейкин, сооснователь и генеральный директор школы XYZ. Мы учим делать игры — создавать 3D-графику и концепты, придумывать персонажей и программировать. За два года через наши курсы прошли 140 000 студентов, которые рекомендуют нас знакомым и хвалят за крутой контент В июне на DTF появился пост: группа студентов XYZ School пожаловалась на один из 45 наших курсов — GameCode. За два дня статья набрала 100 тысяч просмотров и стала самой популярной за всю историю сайта.Привет, на связи Павел Мосейкин, сооснователь и генеральный директор школы XYZ. Мы учим делать игры — создавать 3D-графику и концепты, придумывать персонажей и программировать. За два года через наши курсы прошли 140 000 студентов, которые рекомендуют нас знакомым и хвалят за крутой контент В июне на DTF появился пост: группа студентов XYZ School пожаловалась на один из 45 наших курсов — GameCode. За два дня статья набрала 100 тысяч просмотров и стала самой популярной за всю историю сайта.',
      author: 'Дмитрий',
      cat: 'Интернет',
      img: 'https://www.m24.ru/b/d/nBkSUhL2hFEnmsqyIr6BosSyyJ2gp8TrlnTclb7P73OHezeOWXiSxTZt4slI-BHBsdWR_G-JLsV0=zc8_-mxcKqLEk-c_ELPdrQ.jpg',
      likes: 6,
      date: '11 сентября',
    },
    {
      id: nanoid(),
      title:
        'От кризиса с полупроводниками до конкуренции с Nvidia и AMD: как Intel возвращается на рынок дискретных видеокарт ',
      text: 'В 1998 году Intel выпустила свою первую видеокарту i740, которую раскритиковали за использование оперативной памяти компьютера и низкую производительность. В следующем году компания анонсировала выход новых версий графического процессора i752 и i754, но отправила в производство только первый ограниченным тиражом. Причиной отказа от проекта стал незначительный прирост производительности по сравнению с провалившейся i740. В следующие 20 лет Intel работала только с интегрированной графикой. В апреле 2018 года журнал Fobres сообщил, что производитель готовится выпустить новую дискретную видеокарту и собирает команду для разработки графических процессоров, способных конкурировать с Nvidia и AMD. В августе того же года компания пообещала представить первую карту уже в 2020 году.',
      author: 'Варвара',
      cat: 'Техника',
      img: 'https://leonardo.osnova.io/46e62667-5285-5e17-920b-2f7f5d015d66/-/preview/1800/-/format/webp/',
      likes: 3,
      date: '11 сентряюря',
    },
    {
      id: nanoid(),
      title:
        'Facebook отчиталась о самой низкой квартальной прибыли за год в $9,14 млрд — она оказалась выше прогнозов',
      text: 'Привет, на связи Павел Мосейкин, сооснователь и генеральный директор школы XYZ. Мы учим делать игры — создавать 3D-графику и концепты, придумывать персонажей и программировать. За два года через наши курсы прошли 140 000 студентов, которые рекомендуют нас знакомым и хвалят за крутой контент В июне на DTF появился пост: группа студентов XYZ School пожаловалась на один из 45 наших курсов — GameCode. За два дня статья набрала 100 тысяч просмотров и стала самой популярной за всю историю сайта.',
      author: 'Варвара',
      cat: 'Дизайн',
      img: 'https://www.m24.ru/b/d/nBkSUhL2hFEnmsqyIr6BosSyyJ2gp8TrlnTclb7P73OHezeOWXiSxTZt4slI-BHBsdWR_G-JLsV0=zc8_-mxcKqLEk-c_ELPdrQ.jpg',
      likes: 3,
      date: '11 сентряюря',
    },
    {
      id: nanoid(),
      title:
        'Битва за кроссовки: магазины борются против ботов-перекупщиков, чтобы дать шанс обывателям, и в итоге проигрывают сами',
      text: 'Привет, на связи Павел Мосейкин, сооснователь и генеральный директор школы XYZ. Мы учим делать игры — создавать 3D-графику и концепты, придумывать персонажей и программировать. За два года через наши курсы прошли 140 000 студентов, которые рекомендуют нас знакомым и хвалят за крутой контент В июне на DTF появился пост: группа студентов XYZ School пожаловалась на один из 45 наших курсов — GameCode. За два дня статья набрала 100 тысяч просмотров и стала самой популярной за всю историю сайта.',
      author: 'Дмитрий',
      cat: 'Маркетинг',
      img: 'https://leonardo.osnova.io/09cbf66c-915b-5513-ae38-bb822e2745d3/-/preview/1800/-/format/webp/',
      likes: 25,
      date: '11 сентряюря',
    },
  ],
  categories: [
    {
      name: 'Маркетинг',
      img: 'https://i.pinimg.com/564x/9b/ea/67/9bea67b08810012f4f30878a11a2f6ef.jpg',
      id: nanoid(),
    },
    {
      name: 'Дизайн',
      img: 'https://i.pinimg.com/564x/9b/ea/67/9bea67b08810012f4f30878a11a2f6ef.jpg',
      id: nanoid(),
    },
    {
      name: 'Интернет',
      img: 'https://i.pinimg.com/564x/9b/ea/67/9bea67b08810012f4f30878a11a2f6ef.jpg',
      id: nanoid(),
    },
    {
      name: 'Торговля',
      img: 'https://i.pinimg.com/564x/9b/ea/67/9bea67b08810012f4f30878a11a2f6ef.jpg',
      id: nanoid(),
    },
    {
      name: 'Техника',
      img: 'https://i.pinimg.com/564x/9b/ea/67/9bea67b08810012f4f30878a11a2f6ef.jpg',
      id: nanoid(),
    },
    {
      name: 'Образование',
      img: 'https://i.pinimg.com/564x/9b/ea/67/9bea67b08810012f4f30878a11a2f6ef.jpg',
      id: nanoid(),
    },
    {
      name: 'Кино',
      img: 'https://i.pinimg.com/564x/9b/ea/67/9bea67b08810012f4f30878a11a2f6ef.jpg',
      id: nanoid(),
    },
  ],
};
